levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer4.c
/**
 *******************************************************************************
 * @file  hc32m423_timer4.c
 * @brief This file provides firmware functions to manage the TIMER4
 *        (TIMER4).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-03       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_timer4.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TIMER4 TIMER4
 * @brief TIMER4 Driver Library
 * @{
 */

#if (DDL_TIMER4_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TIMER4_Local_Macros TIMER4 Local Macros
 * @{
 */

/**
 * @defgroup TIMER4_Check_Parameters_Validity TIMER4 Check Parameters Validity
 * @{
 */

#define IS_VALID_TIMER4_CNT_CLK_DIV(x)                                         \
(   ((x) == TIMER4_CNT_CLK_DIV1)                ||                             \
    ((x) == TIMER4_CNT_CLK_DIV2)                ||                             \
    ((x) == TIMER4_CNT_CLK_DIV4)                ||                             \
    ((x) == TIMER4_CNT_CLK_DIV8)                ||                             \
    ((x) == TIMER4_CNT_CLK_DIV16)               ||                             \
    ((x) == TIMER4_CNT_CLK_DIV32)               ||                             \
    ((x) == TIMER4_CNT_CLK_DIV64)               ||                             \
    ((x) == TIMER4_CNT_CLK_DIV128)              ||                             \
    ((x) == TIMER4_CNT_CLK_DIV256)              ||                             \
    ((x) == TIMER4_CNT_CLK_DIV512)              ||                             \
    ((x) == TIMER4_CNT_CLK_DIV1024))

#define IS_VALID_TIMER4_CNT_MODE(x)                                            \
(   ((x) == TIMER4_CNT_MODE_SAWTOOTH_WAVE)      ||                             \
    ((x) == TIMER4_CNT_MODE_TRIANGLE_WAVE))

#define IS_VALID_TIMER4_CNT_CLK_SRC(x)                                         \
(   ((x) == TIMER4_CNT_PCLK)                    ||                             \
    ((x) == TIMER4_CNT_EXTCLK))

#define IS_VALID_TIMER4_CNT_INT_MSK(x)                                         \
(   ((x) == TIMER4_CNT_INT_MASK_0)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_1)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_2)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_3)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_4)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_5)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_6)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_7)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_8)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_9)              ||                             \
    ((x) == TIMER4_CNT_INT_MASK_10)             ||                             \
    ((x) == TIMER4_CNT_INT_MASK_11)             ||                             \
    ((x) == TIMER4_CNT_INT_MASK_12)             ||                             \
    ((x) == TIMER4_CNT_INT_MASK_13)             ||                             \
    ((x) == TIMER4_CNT_INT_MASK_14)             ||                             \
    ((x) == TIMER4_CNT_INT_MASK_15))

#define IS_VALID_TIMER4_CNT_INT(x)                                             \
(   ((x) == TIMER4_CNT_IT_ZERO)                 ||                             \
    ((x) == TIMER4_CNT_IT_PEAK))

#define IS_VALID_TIMER4_CNT_FLAG(x)                                            \
(   ((x) == TIMER4_CNT_FLAG_ZERO)               ||                             \
    ((x) == TIMER4_CNT_FLAG_PEAK))

#define IS_VALID_TIMER4_CNT_DIRSIG(x)                                          \
(   ((x) == TIMER4_CNT_CNTDIRSIG_OUTPUT_ENABLE) ||                             \
    ((x) == TIMER4_CNT_CNTDIRSIG_OUTPUT_DISABLE))

#define IS_VALID_TIMER4_OCO_CH(x)                                              \
(   ((x) == TIMER4_OCO_UH)                      ||                             \
    ((x) == TIMER4_OCO_UL)                      ||                             \
    ((x) == TIMER4_OCO_VH)                      ||                             \
    ((x) == TIMER4_OCO_VL)                      ||                             \
    ((x) == TIMER4_OCO_WH)                      ||                             \
    ((x) == TIMER4_OCO_WL))

#define IS_VALID_TIMER4_OCO_HIGH_CH(x)                                         \
(   ((x) == TIMER4_OCO_UH)                      ||                             \
    ((x) == TIMER4_OCO_VH)                      ||                             \
    ((x) == TIMER4_OCO_WH))

#define IS_VALID_TIMER4_OCO_LOW_CH(x)                                          \
(   ((x) == TIMER4_OCO_UL)                      ||                             \
    ((x) == TIMER4_OCO_VL)                      ||                             \
    ((x) == TIMER4_OCO_WL))

#define IS_VALID_TIMER4_OCO_OCCR_BUF_MODE(x)                                   \
(   ((x) == TIMER4_OCO_OCCR_BUF_DISABLE)        ||                             \
    ((x) == TIMER4_OCO_OCCR_BUF_CNT_ZERO)       ||                             \
    ((x) == TIMER4_OCO_OCCR_BUF_CNT_PEAK)       ||                             \
    ((x) == TIMER4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK))

#define IS_VALID_TIMER4_OCO_OCMR_BUF_MODE(x)                                   \
(   ((x) == TIMER4_OCO_OCMR_BUF_DISABLE)        ||                             \
    ((x) == TIMER4_OCO_OCMR_BUF_CNT_ZERO)       ||                             \
    ((x) == TIMER4_OCO_OCMR_BUF_CNT_PEAK)       ||                             \
    ((x) == TIMER4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK))

#define IS_VALID_TIMER4_OCO_PORT_INVALID_OP(x)                                 \
(   ((x) == TIMER4_OCO_INVAILD_OP_LOW)          ||                             \
    ((x) == TIMER4_OCO_INVAILD_OP_HIGH))

#define IS_VALID_TIMER4_OCO_OCF_STATE(x)                                       \
(   ((x) == TIMER4_OCO_OCF_HOLD)                ||                             \
    ((x) == TIMER4_OCO_OCF_SET))

#define IS_VALID_TIMER4_OCO_OCF_STATE(x)                                       \
(   ((x) == TIMER4_OCO_OCF_HOLD)                ||                             \
    ((x) == TIMER4_OCO_OCF_SET))

#define IS_VALID_TIMER4_OCO_OUTPUT_POLARITY(x)                                 \
(   ((x) == TIMER4_OCO_OP_HOLD)                 ||                             \
    ((x) == TIMER4_OCO_OP_HIGH)                 ||                             \
    ((x) == TIMER4_OCO_OP_LOW)                  ||                             \
    ((x) == TIMER4_OCO_OP_INVERT))

