levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer4.c
    switch (u16IntSource)
    {
        case TIMER4_CNT_IT_ZERO:
            bM4_TMR4->CCSR_b.IRQZEN = enNewSta;
            break;
        case TIMER4_CNT_IT_PEAK:
            bM4_TMR4->CCSR_b.IRQPEN = enNewSta;
            break;
        default:
            break;
    }
}

/**
 * @brief  Set Timer4 CNT interrupt mask times
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_IT_PEAK:   Overflow interrupt
 *           @arg TIMER4_CNT_IT_ZERO:   Underflow interrupt
 * @param [in] u16MaskTimes                 Timer4 CNT interrupt mask times
 *           @arg TIMER4_CNT_INT_MASK_0:    CNT interrupt flag is always set(not masked) for every CNT count at "0x0000" or peak
 *           @arg TIMER4_CNT_INT_MASK_1:    CNT interrupt flag is set once for 2 every CNT counts at "0x0000" or peak (skiping 1 count)
 *           @arg TIMER4_CNT_INT_MASK_2:    CNT interrupt flag is set once for 3 every CNT counts at "0x0000" or peak (skiping 2 count)
 *           @arg TIMER4_CNT_INT_MASK_3:    CNT interrupt flag is set once for 4 every CNT counts at "0x0000" or peak (skiping 3 count)
 *           @arg TIMER4_CNT_INT_MASK_4:    CNT interrupt flag is set once for 5 every CNT counts at "0x0000" or peak (skiping 4 count)
 *           @arg TIMER4_CNT_INT_MASK_5:    CNT interrupt flag is set once for 6 every CNT counts at "0x0000" or peak (skiping 5 count)
 *           @arg TIMER4_CNT_INT_MASK_6:    CNT interrupt flag is set once for 7 every CNT counts at "0x0000" or peak (skiping 6 count)
 *           @arg TIMER4_CNT_INT_MASK_7:    CNT interrupt flag is set once for 8 every CNT counts at "0x0000" or peak (skiping 7 count)
 *           @arg TIMER4_CNT_INT_MASK_8:    CNT interrupt flag is set once for 9 every CNT counts at "0x0000" or peak (skiping 8 count)
 *           @arg TIMER4_CNT_INT_MASK_9:    CNT interrupt flag is set once for 10 every CNT counts at "0x0000" or peak (skiping 9 count)
 *           @arg TIMER4_CNT_INT_MASK_10:   CNT interrupt flag is set once for 11 every CNT counts at "0x0000" or peak (skiping 10 count)
 *           @arg TIMER4_CNT_INT_MASK_11:   CNT interrupt flag is set once for 12 every CNT counts at "0x0000" or peak (skiping 11 count)
 *           @arg TIMER4_CNT_INT_MASK_12:   CNT interrupt flag is set once for 13 every CNT counts at "0x0000" or peak (skiping 12 count)
 *           @arg TIMER4_CNT_INT_MASK_13:   CNT interrupt flag is set once for 14 every CNT counts at "0x0000" or peak (skiping 13 count)
 *           @arg TIMER4_CNT_INT_MASK_14:   CNT interrupt flag is set once for 15 every CNT counts at "0x0000" or peak (skiping 14 count)
 *           @arg TIMER4_CNT_INT_MASK_15:   CNT interrupt flag is set once for 16 every CNT counts at "0x0000" or peak (skiping 15 count)
 * @retval None
 */
void TIMER4_CNT_SetIntMaskTimes(uint16_t u16IntSource,
                                uint16_t u16MaskTimes)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_CNT_INT(u16IntSource));
    DDL_ASSERT(IS_VALID_TIMER4_CNT_INT_MSK(u16MaskTimes));

    switch (u16IntSource)
    {
        case TIMER4_CNT_IT_ZERO:
            MODIFY_REG16(M4_TMR4->CVPR, TMR4_CVPR_ZIM, (uint16_t)(u16MaskTimes << TMR4_CVPR_ZIM_POS));
            break;
        case TIMER4_CNT_IT_PEAK:
            MODIFY_REG16(M4_TMR4->CVPR, TMR4_CVPR_PIM, (uint16_t)(u16MaskTimes << TMR4_CVPR_PIM_POS));
            break;
        default:
            break;
    }
}

/**
 * @brief  Get Timer4 CNT interrupt mask times
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_IT_PEAK:   Overflow interrupt
 *           @arg TIMER4_CNT_IT_ZERO:   Underflow interrupt
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_CNT_INT_MASK_0:    CNT interrupt flag is always set(not masked) for every CNT count at "0x0000" or peak
 *           @arg TIMER4_CNT_INT_MASK_1:    CNT interrupt flag is set once for 2 every CNT counts at "0x0000" or peak (skiping 1 count)
 *           @arg TIMER4_CNT_INT_MASK_2:    CNT interrupt flag is set once for 3 every CNT counts at "0x0000" or peak (skiping 2 count)
 *           @arg TIMER4_CNT_INT_MASK_3:    CNT interrupt flag is set once for 4 every CNT counts at "0x0000" or peak (skiping 3 count)
 *           @arg TIMER4_CNT_INT_MASK_4:    CNT interrupt flag is set once for 5 every CNT counts at "0x0000" or peak (skiping 4 count)
 *           @arg TIMER4_CNT_INT_MASK_5:    CNT interrupt flag is set once for 6 every CNT counts at "0x0000" or peak (skiping 5 count)
 *           @arg TIMER4_CNT_INT_MASK_6:    CNT interrupt flag is set once for 7 every CNT counts at "0x0000" or peak (skiping 6 count)
 *           @arg TIMER4_CNT_INT_MASK_7:    CNT interrupt flag is set once for 8 every CNT counts at "0x0000" or peak (skiping 7 count)
 *           @arg TIMER4_CNT_INT_MASK_8:    CNT interrupt flag is set once for 9 every CNT counts at "0x0000" or peak (skiping 8 count)
 *           @arg TIMER4_CNT_INT_MASK_9:    CNT interrupt flag is set once for 10 every CNT counts at "0x0000" or peak (skiping 9 count)
 *           @arg TIMER4_CNT_INT_MASK_10:   CNT interrupt flag is set once for 11 every CNT counts at "0x0000" or peak (skiping 10 count)
 *           @arg TIMER4_CNT_INT_MASK_11:   CNT interrupt flag is set once for 12 every CNT counts at "0x0000" or peak (skiping 11 count)
 *           @arg TIMER4_CNT_INT_MASK_12:   CNT interrupt flag is set once for 13 every CNT counts at "0x0000" or peak (skiping 12 count)
 *           @arg TIMER4_CNT_INT_MASK_13:   CNT interrupt flag is set once for 14 every CNT counts at "0x0000" or peak (skiping 13 count)
 *           @arg TIMER4_CNT_INT_MASK_14:   CNT interrupt flag is set once for 15 every CNT counts at "0x0000" or peak (skiping 14 count)
 *           @arg TIMER4_CNT_INT_MASK_15:   CNT interrupt flag is set once for 16 every CNT counts at "0x0000" or peak (skiping 15 count)
 *           @arg TIMER4_RESULT_ERROR:      TimerB interrupt source is invalid
 */
uint16_t TIMER4_CNT_GetIntMaskTimes(uint16_t u16IntSource)
{
    uint16_t u16MaskTimes;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_CNT_INT(u16IntSource));

