levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer4.c
    switch (u16IntSource)
    {
        case TIMER4_CNT_IT_ZERO:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M4_TMR4->CVPR, TMR4_CVPR_ZIM) >> TMR4_CVPR_ZIM_POS);
            break;
        case TIMER4_CNT_IT_PEAK:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M4_TMR4->CVPR, TMR4_CVPR_PIM) >> TMR4_CVPR_PIM_POS);
            break;
        default:
            u16MaskTimes = TIMER4_RESULT_ERROR;
            break;
    }

    return u16MaskTimes;
}

/**
 * @brief  Get Timer4 CNT interrupt mask current times
 * @param  [in] u16IntSource            TimerB interrupt source
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_IT_PEAK:   Overflow interrupt
 *           @arg TIMER4_CNT_IT_ZERO:   Underflow interrupt
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_CNT_INT_MASK_0:    CNT interrupt flag is always set(not masked) for every CNT count at "0x0000" or peak
 *           @arg TIMER4_CNT_INT_MASK_1:    CNT interrupt flag is set once for 2 every CNT counts at "0x0000" or peak (skiping 1 count)
 *           @arg TIMER4_CNT_INT_MASK_2:    CNT interrupt flag is set once for 3 every CNT counts at "0x0000" or peak (skiping 2 count)
 *           @arg TIMER4_CNT_INT_MASK_3:    CNT interrupt flag is set once for 4 every CNT counts at "0x0000" or peak (skiping 3 count)
 *           @arg TIMER4_CNT_INT_MASK_4:    CNT interrupt flag is set once for 5 every CNT counts at "0x0000" or peak (skiping 4 count)
 *           @arg TIMER4_CNT_INT_MASK_5:    CNT interrupt flag is set once for 6 every CNT counts at "0x0000" or peak (skiping 5 count)
 *           @arg TIMER4_CNT_INT_MASK_6:    CNT interrupt flag is set once for 7 every CNT counts at "0x0000" or peak (skiping 6 count)
 *           @arg TIMER4_CNT_INT_MASK_7:    CNT interrupt flag is set once for 8 every CNT counts at "0x0000" or peak (skiping 7 count)
 *           @arg TIMER4_CNT_INT_MASK_8:    CNT interrupt flag is set once for 9 every CNT counts at "0x0000" or peak (skiping 8 count)
 *           @arg TIMER4_CNT_INT_MASK_9:    CNT interrupt flag is set once for 10 every CNT counts at "0x0000" or peak (skiping 9 count)
 *           @arg TIMER4_CNT_INT_MASK_10:   CNT interrupt flag is set once for 11 every CNT counts at "0x0000" or peak (skiping 10 count)
 *           @arg TIMER4_CNT_INT_MASK_11:   CNT interrupt flag is set once for 12 every CNT counts at "0x0000" or peak (skiping 11 count)
 *           @arg TIMER4_CNT_INT_MASK_12:   CNT interrupt flag is set once for 13 every CNT counts at "0x0000" or peak (skiping 12 count)
 *           @arg TIMER4_CNT_INT_MASK_13:   CNT interrupt flag is set once for 14 every CNT counts at "0x0000" or peak (skiping 13 count)
 *           @arg TIMER4_CNT_INT_MASK_14:   CNT interrupt flag is set once for 15 every CNT counts at "0x0000" or peak (skiping 14 count)
 *           @arg TIMER4_CNT_INT_MASK_15:   CNT interrupt flag is set once for 16 every CNT counts at "0x0000" or peak (skiping 15 count)
 *           @arg TIMER4_RESULT_ERROR:      TimerB interrupt source is invalid
 */
uint16_t TIMER4_CNT_GetIntMaskCurrenTimes(uint16_t u16IntSource)
{
    uint16_t u16MaskTimes;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_CNT_INT(u16IntSource));

    switch (u16IntSource)
    {
        case TIMER4_CNT_IT_ZERO:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M4_TMR4->CVPR, TMR4_CVPR_ZIC) >> TMR4_CVPR_ZIC_POS);
            break;
        case TIMER4_CNT_IT_PEAK:
            u16MaskTimes = (uint16_t)(READ_REG16_BIT(M4_TMR4->CVPR, TMR4_CVPR_PIC) >> TMR4_CVPR_PIC_POS);
            break;
        default:
            u16MaskTimes = TIMER4_RESULT_ERROR;
            break;
    }

    return u16MaskTimes;
}

/**
 * @brief  Set Timer4 CNT count direction signal output to port
 * @param  [in] u16CntDirSig         Timer4 CNT count direction signal selection
 *         This parameter can be one of the following values:
 *           @arg TIMER4_CNT_CNTDIRSIG_OUTPUT_DISABLE:  Disable output count direction signal
 *           @arg TIMER4_CNT_CNTDIRSIG_OUTPUT_ENABLE:   Enable output count direction signal
 * @retval None
 */
void TIMER4_CNT_SetCntDirSigOutput(uint16_t u16CntDirSig)
{
    DDL_ASSERT(IS_VALID_TIMER4_CNT_DIRSIG(u16CntDirSig));

    WRITE_REG32(bM4_TMR4->SCER_b.PCTS, (u16CntDirSig == TIMER4_CNT_CNTDIRSIG_OUTPUT_ENABLE) ? 1UL : 0UL);
}

/**
 * @}
 */

/**
 * @defgroup TIMER4_OCO_Global_Functions TIMER4 OCO Global Functions
 * @{
 */

/**
 * @brief  Initialize Timer4 OCO
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] pstcInit            Pointer to a @ref stc_timer4_oco_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TIMER4_OCO_Init(uint32_t u32Ch,
                                const stc_timer4_oco_init_t *pstcInit)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCSR;
    __IO uint16_t *TMR4_OCCR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if ((IS_VALID_TIMER4_OCO_CH(u32Ch)) && (NULL != pstcInit))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOcoCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOcoIntCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOccrLinkTransfer));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInit->enOcmrLinkTransfer));
        DDL_ASSERT(IS_VALID_TIMER4_OCO_OCCR_BUF_MODE(pstcInit->u16OccrBufMode));
        DDL_ASSERT(IS_VALID_TIMER4_OCO_OCMR_BUF_MODE(pstcInit->u16OcmrBufMode));
        DDL_ASSERT(IS_VALID_TIMER4_OCO_PORT_INVALID_OP(pstcInit->u16OcoInvalidOp));

