levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer4.c
        enRet = Ok;
        /* Get pointer of current channel OCO register address */
        TMR4_OCSR = TMR4_OCSRx(M4_TMR4, u32Ch);
        TMR4_OCER = TMR4_OCERx(M4_TMR4, u32Ch);
        TMR4_OCCR = TMR4_OCCRx(M4_TMR4, u32Ch);

        /* Set OCMR and OCCR buffer mode */
        if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch)) /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
        {
            /* Set port output valid && OP level && interrupt */
            MODIFY_REG16(*TMR4_OCSR, \
                         (TMR4_OCSR_OCEH  | \
                          TMR4_OCSR_OCPH  | \
                          TMR4_OCSR_OCIEH | \
                          TMR4_OCSR_OCFH),  \
                         ((uint16_t)((uint16_t)pstcInit->enOcoCmd << TMR4_OCSR_OCEH_POS)    | \
                          (uint16_t)(pstcInit->u16OcoInvalidOp << TMR4_OCSR_OCPH_POS)       | \
                          (uint16_t)((uint16_t)pstcInit->enOcoIntCmd << TMR4_OCSR_OCIEH_POS)));

            /* Set OCMR&&OCCR buffer */
            MODIFY_REG16(*TMR4_OCER, \
                         (TMR4_OCER_CHBUFEN | \
                          TMR4_OCER_MHBUFEN | \
                          TMR4_OCER_LMCH    | \
                          TMR4_OCER_LMMH),    \
                         ((uint16_t)(pstcInit->u16OccrBufMode << TMR4_OCER_CHBUFEN_POS)  | \
                          (uint16_t)(pstcInit->u16OcmrBufMode << TMR4_OCER_MHBUFEN_POS)  | \
                          (uint16_t)((uint16_t)pstcInit->enOccrLinkTransfer << TMR4_OCER_LMCH_POS) | \
                          (uint16_t)((uint16_t)pstcInit->enOcmrLinkTransfer << TMR4_OCER_LMMH_POS)));
        }
        else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
        {
            /* Set port output valid && OP level && interrupt */
            MODIFY_REG16(*TMR4_OCSR, \
                         (TMR4_OCSR_OCEL  | \
                          TMR4_OCSR_OCPL  | \
                          TMR4_OCSR_OCIEL | \
                          TMR4_OCSR_OCFL),  \
                         ((uint16_t)((uint16_t)pstcInit->enOcoCmd << TMR4_OCSR_OCEL_POS)    | \
                          (uint16_t)(pstcInit->u16OcoInvalidOp << TMR4_OCSR_OCPL_POS)       | \
                          (uint16_t)((uint16_t)pstcInit->enOcoIntCmd << TMR4_OCSR_OCIEL_POS)));

            /* Set OCMR&&OCCR buffer */
            MODIFY_REG16(*TMR4_OCER, \
                         (TMR4_OCER_CLBUFEN | \
                          TMR4_OCER_MLBUFEN | \
                          TMR4_OCER_LMCL    | \
                          TMR4_OCER_LMML),    \
                         ((uint16_t)(pstcInit->u16OccrBufMode << TMR4_OCER_CLBUFEN_POS)  | \
                          (uint16_t)(pstcInit->u16OcmrBufMode << TMR4_OCER_MLBUFEN_POS)  | \
                          (uint16_t)((uint16_t)pstcInit->enOccrLinkTransfer << TMR4_OCER_LMCL_POS) | \
                          (uint16_t)((uint16_t)pstcInit->enOcmrLinkTransfer << TMR4_OCER_LMML_POS)));
        }
        else
        {
            enRet = ErrorInvalidParameter;;
        }

        /* Set OCO compare match value */
        WRITE_REG16(*TMR4_OCCR, pstcInit->u16OccrVal);
    }

    return enRet;
}

/**
 * @brief  Initialize Timer4 OCO
 * @brief  Set the fields of structure stc_timer4_oco_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_timer4_oco_init_t structure (TMRBx unit OCO function configuration data structure)
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TIMER4_OCO_StructInit(stc_timer4_oco_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->enOcoIntCmd = Disable;
        pstcInit->enOcoCmd = Disable;
        pstcInit->enOccrLinkTransfer = Disable;
        pstcInit->enOcmrLinkTransfer = Disable;
        pstcInit->u16OccrBufMode = TIMER4_OCO_OCCR_BUF_DISABLE;
        pstcInit->u16OcmrBufMode = TIMER4_OCO_OCMR_BUF_DISABLE;
        pstcInit->u16OcoInvalidOp = TIMER4_OCO_INVAILD_OP_LOW;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initialize Timer4 OCO
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_DeInit(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCSR;
    en_result_t enRet = Ok;

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(M4_TMR4, u32Ch);
    TMR4_OCER = TMR4_OCERx(M4_TMR4, u32Ch);

    /* Set OCMR and OCCR buffer mode */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch)) /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        CLEAR_REG16_BIT(*TMR4_OCSR, (TMR4_OCSR_OCEH | TMR4_OCSR_OCFH));

        /* Clear bits: port output valid && OP level && interrupt */
        CLEAR_REG16_BIT(*TMR4_OCSR, \
                        (TMR4_OCSR_OCEH  | TMR4_OCSR_OCPH | \
                        TMR4_OCSR_OCIEH | TMR4_OCSR_OCFH));

        /* Clear bits: OCMR&&OCCR buffer */
        CLEAR_REG16_BIT(*TMR4_OCER, \
                        (TMR4_OCER_CHBUFEN | TMR4_OCER_MHBUFEN | \
                         TMR4_OCER_LMCH    | TMR4_OCER_LMMH));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        CLEAR_REG16_BIT(*TMR4_OCSR, (TMR4_OCSR_OCEL | TMR4_OCSR_OCFL));

        /* Clear bits: port output valid && OP level && interrupt */
        CLEAR_REG16_BIT(*TMR4_OCSR, \
                        (TMR4_OCSR_OCEL  | TMR4_OCSR_OCPL | \
                         TMR4_OCSR_OCIEL | TMR4_OCSR_OCFL));

        /* Clear bits: OCMR&&OCCR buffer */
        CLEAR_REG16_BIT(*TMR4_OCER, \
                        (TMR4_OCER_CLBUFEN | TMR4_OCER_MLBUFEN | \
                         TMR4_OCER_LMCL    | TMR4_OCER_LMML));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 OCO OCCR buffer mode
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] u16OccrBufMode      Timer4 OCO OCCR buffer mode
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_OCCR_BUF_DISABLE:          Disable the register OCCR buffer function
 *           @arg TIMER4_OCO_OCCR_BUF_CNT_ZERO:         Register OCCR buffer transfer when counter value is 0x0000
 *           @arg TIMER4_OCO_OCCR_BUF_CNT_PEAK:         Register OCCR buffer transfer when counter value is CPSR
 *           @arg TIMER4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK: Register OCCR buffer transfer when the value is both 0 and CPSR
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_SetOccrBufMode(uint32_t u32Ch,
                                uint16_t u16OccrBufMode)
{
    __IO uint16_t *TMR4_OCER;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_OCO_OCCR_BUF_MODE(u16OccrBufMode));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(M4_TMR4, u32Ch);

    /* Set OCCR buffer mode */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_CHBUFEN, (uint16_t)(u16OccrBufMode << TMR4_OCER_CHBUFEN_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_CLBUFEN, (uint16_t)(u16OccrBufMode << TMR4_OCER_CLBUFEN_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 OCO OCCR buffer mode
 *         This parameter can be one of the following values:
 * @param  [in] u32Ch               Timer4 OCO channel
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_OCO_OCCR_BUF_DISABLE:          Disable the register OCCR buffer function
 *           @arg TIMER4_OCO_OCCR_BUF_CNT_ZERO:         Register OCCR buffer transfer when counter value is 0x0000
 *           @arg TIMER4_OCO_OCCR_BUF_CNT_PEAK:         Register OCCR buffer transfer when counter value is CPSR
 *           @arg TIMER4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK: Register OCCR buffer transfer when the value is both 0 and CPSR
 *           @arg TIMER4_RESULT_ERROR:                  Timer4 OCO channel is invalid
 */
uint16_t TIMER4_OCO_GetOccrBufMode(uint32_t u32Ch)
{
    uint16_t OccrBufMode;
    __IO uint16_t *TMR4_OCER;

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(M4_TMR4, u32Ch);

    /* Get OCCR buffer mode */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        OccrBufMode = (READ_REG16_BIT(*TMR4_OCER, TMR4_OCER_CHBUFEN) >> TMR4_OCER_CHBUFEN_POS);
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        OccrBufMode = (READ_REG16_BIT(*TMR4_OCER, TMR4_OCER_CLBUFEN) >> TMR4_OCER_CLBUFEN_POS);
    }
    else
    {
        OccrBufMode = TIMER4_RESULT_ERROR;
    }

    return OccrBufMode;
}

/**
 * @brief  Set Timer4 OCO OCCR buffer link transfer function
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] enNewSta            The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_OccrLinkTransferCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta)
{
    __IO uint16_t *TMR4_OCER;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(M4_TMR4, u32Ch);

    /* Set OCCR link transfer */
    if (IS_VALID_TIMER4_OCO_HIGH_CH(u32Ch))     /* channel: TIMER4_OCO_UH, TIMER4_OCO_VH, TIMER4_OCO_WH */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_LMCH, ((uint16_t)enNewSta << TMR4_OCER_LMCH_POS));
    }
    else if (IS_VALID_TIMER4_OCO_LOW_CH(u32Ch)) /* channel: TIMER4_OCO_UL, TIMER4_OCO_VL, TIMER4_OCO_WL */
    {
        MODIFY_REG16(*TMR4_OCER, TMR4_OCER_LMCL, ((uint16_t)enNewSta << TMR4_OCER_LMCL_POS));
    }
    else
    {
        enRet = ErrorInvalidParameter;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 OCO OCMR buffer mode
 * @param  [in] u32Ch               Timer4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_UH:    Timer4 OCO channel:UH
 *           @arg TIMER4_OCO_UL:    Timer4 OCO channel:UL
 *           @arg TIMER4_OCO_VH:    Timer4 OCO channel:VH
 *           @arg TIMER4_OCO_VL:    Timer4 OCO channel:VL
 *           @arg TIMER4_OCO_WH:    Timer4 OCO channel:WH
 *           @arg TIMER4_OCO_WL:    Timer4 OCO channel:WL
 * @param  [in] u16OcmrBufMode      Timer4 OCO OCCR buffer mode
 *         This parameter can be one of the following values:
 *           @arg TIMER4_OCO_OCMR_BUF_DISABLE:          Disable the register OCMR buffer function
 *           @arg TIMER4_OCO_OCMR_BUF_CNT_ZERO:         Register OCMR buffer transfer when counter value is 0x0000
 *           @arg TIMER4_OCO_OCMR_BUF_CNT_PEAK:         Register OCMR buffer transfer when counter value is CPSR
 *           @arg TIMER4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK: Register OCMR buffer transfer when the value is both 0 and CPSR
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_OCO_SetOcmrBufMode(uint32_t u32Ch,
                                uint16_t u16OcmrBufMode)
{
    __IO uint16_t *TMR4_OCER;
    en_result_t enRet = Ok;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TIMER4_OCO_OCMR_BUF_MODE(u16OcmrBufMode));

    /* Get pointer of current channel OCO register address */
    TMR4_OCER = TMR4_OCERx(M4_TMR4, u32Ch);

