levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer4.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->enRtIntMaskCmd = Disable;
        pstcInit->u16ClkDiv = TIMER4_PWM_CLK_DIV1;
        pstcInit->u16Mode = TIMER4_PWM_THROUGH_MODE;
        pstcInit->u16PwmOutputPolarity = TIMER4_PWM_OP_OXH_HOLD_OXL_HOLD;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initialize Timer4 PWM
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_DeInit(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_POCR;
    __IO uint16_t *TMR4_RCSR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check channel */
    if (IS_VALID_TIMER4_PWM_CH(u32Ch))
    {
        /* Get pointer of current channel PWM register address */
        TMR4_POCR = TMR4_POCRx(M4_TMR4, u32Ch);
        TMR4_RCSR = TMR4_RCSRx(M4_TMR4);

        /* Set POCR register */
        WRITE_REG16(*TMR4_POCR, (TIMER4_PWM_CLK_DIV1 | TIMER4_PWM_THROUGH_MODE | TIMER4_PWM_OP_OXH_HOLD_OXL_HOLD));

        /* Set RCSR register */
        MODIFY_REG16(*TMR4_RCSR,
                      (TMR4_RCSR_RTIDx(u32Ch) | TMR4_RCSR_RTEx(u32Ch) | TMR4_RCSR_RTSx(u32Ch)), \
                      TMR4_RCSR_RTSx(u32Ch));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 PWM output polarity
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @param  [in] u16OutputPolarity   Timer4 PWM output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_OP_OXH_HOLD_OXL_HOLD:      Output PWML and PWMH signals without changing the level
 *           @arg TIMER4_PWM_OP_OXH_INVERT_OXL_INVERT:  Output both PWML and PWMH signals reversed
 *           @arg TIMER4_PWM_OP_OXH_INVERT_OXL_HOLD:    Output the PWMH signal reversed, outputs the PWML signal without changing the level
 *           @arg TIMER4_PWM_OP_OXH_HOLD_OXL_INVERT:    Output the PWMH signal without changing the level, Outputs the PWML signal reversed
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_SetOutputPolarity(uint32_t u32Ch,
                                                uint16_t u16OutputPolarity)
{
    __IO uint16_t *TMR4_POCR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check channel */
    if (IS_VALID_TIMER4_PWM_CH(u32Ch))
    {
        DDL_ASSERT(IS_VALID_TIMER4_PWM_OUTPUT_POLARITY(u16OutputPolarity));

        /* Get pointer of current channel PWM register address */
        TMR4_POCR = TMR4_POCRx(M4_TMR4, u32Ch);

        MODIFY_REG16(*TMR4_POCR, TMR4_POCR_LVLS, u16OutputPolarity);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 PWM output polarity
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_PWM_OP_OXH_HOLD_OXL_HOLD:      Output PWML and PWMH signals without changing the level
 *           @arg TIMER4_PWM_OP_OXH_INVERT_OXL_INVERT:  Output both PWML and PWMH signals reversed
 *           @arg TIMER4_PWM_OP_OXH_INVERT_OXL_HOLD:    Output the PWMH signal reversed, outputs the PWML signal without changing the level
 *           @arg TIMER4_PWM_OP_OXH_HOLD_OXL_INVERT:    Output the PWMH signal without changing the level, Outputs the PWML signal reversed
 */
uint16_t TIMER4_PWM_GetOutputPolarity(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_POCR;

    /* Check PWM channel */
    DDL_ASSERT(IS_VALID_TIMER4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_POCR = TMR4_POCRx(M4_TMR4, u32Ch);

    return READ_REG16_BIT(*TMR4_POCR, TMR4_POCR_LVLS);
}

/**
 * @brief  Start Timer4 PWM reload-timer
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @retval An en_result_t enumeration value:
 *           - Ok: Start successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_StartReloadTimer(uint32_t u32Ch)
{
    en_result_t enRet = Ok;

    switch (u32Ch)
    {
        case TIMER4_PWM_U:
            bM4_TMR4->RCSR_b.RTEU = 1UL;
            break;
        case TIMER4_PWM_V:
            bM4_TMR4->RCSR_b.RTEV = 1UL;
            break;
        case TIMER4_PWM_W:
            bM4_TMR4->RCSR_b.RTEW = 1UL;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 * @brief  Stop Timer4 PWM reload-timer
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @retval An en_result_t enumeration value:
 *           - Ok: Stop successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_StopReloadTimer(uint32_t u32Ch)
{
    en_result_t enRet = Ok;

    switch (u32Ch)
    {
        case TIMER4_PWM_U:
            bM4_TMR4->RCSR_b.RTSU = 1UL;
            break;
        case TIMER4_PWM_V:
            bM4_TMR4->RCSR_b.RTSV = 1UL;
            break;
        case TIMER4_PWM_W:
            bM4_TMR4->RCSR_b.RTSW = 1UL;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 * @brief  Set the Timer4 PWM interrupt function
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @param  [in] enNewSta            The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_IntCmd(uint32_t u32Ch,
                                en_functional_state_t enNewSta)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    switch (u32Ch)
    {
        case TIMER4_PWM_U:
            bM4_TMR4->RCSR_b.RTIDU = enNewSta;
            break;
        case TIMER4_PWM_V:
            bM4_TMR4->RCSR_b.RTIDV = enNewSta;
            break;
        case TIMER4_PWM_W:
            bM4_TMR4->RCSR_b.RTIDW = enNewSta;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 * @brief  Get PWM reload-timer interrupt flag
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @retval An en_flag_status_t enumeration value:
 *           - Reset                None interrupt request on PWM reload-timer
 *           - Set                  Detection interrupt request on PWM reload-timer
 */
en_flag_status_t TIMER4_PWM_GetFlag(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_RCSR;

    /* Check channel */
    DDL_ASSERT(IS_VALID_TIMER4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_RCSR = TMR4_RCSRx(M4_TMR4);

    return (READ_REG16_BIT(*TMR4_RCSR, TMR4_RCSR_RTIFx(u32Ch)) ? Set : Reset);
}

/**
 * @brief  Clear PWM reload-timer interrupt flag
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @retval An en_result_t enumeration value:
 *           - Ok: Clear successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_ClearFlag(uint32_t u32Ch)
{
    en_result_t enRet = Ok;

    switch (u32Ch)
    {
        case TIMER4_PWM_U:
            bM4_TMR4->RCSR_b.RTICU = 1UL;
            break;
        case TIMER4_PWM_V:
            bM4_TMR4->RCSR_b.RTICV = 1UL;
            break;
        case TIMER4_PWM_W:
            bM4_TMR4->RCSR_b.RTICW = 1UL;
            break;
        default:
            enRet = ErrorInvalidParameter;
            break;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 PWM dead region count
 * @param  [in] u32Ch               Timer4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_PWM_U:     Timer4 PWM couple channel: U
 *           @arg TIMER4_PWM_V:     Timer4 PWM couple channel: V
 *           @arg TIMER4_PWM_W:     Timer4 PWM couple channel: W
 * @param  [in] u16PDAR             PDAR value
 *           @arg number of 16bit
 * @param  [in] u16PDBR             PDBR value
 *           @arg number of 16bit
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_PWM_SetDeadRegionValue(uint32_t u32Ch,
                                                uint16_t u16PDAR,
                                                uint16_t u16PDBR)
{
    __IO uint16_t *TMR4_PDAR;
    __IO uint16_t *TMR4_PDBR;
    en_result_t enRet = ErrorInvalidParameter;

