levizh/hc32m423/ddl/hc32m423_ddl/driver/src/hc32m423_timer4.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u16SccrVal = 0U;
        pstcInit->u16Mode = TIMER4_SEVT_MODE_COMPARE_TRIGGER;
        pstcInit->u16TrigEvt = TIMER4_SEVT_TRIGGER_TMR4_SCMUH;
        pstcInit->u16BufMode = TIMER4_SEVT_BUF_DISABLE;
        pstcInit->enLinkTransfer = Disable;
        pstcInit->stcTriggerCond.enDownMatchCmd = Disable;
        pstcInit->stcTriggerCond.enPeakMatchCmd = Disable;
        pstcInit->stcTriggerCond.enUpMatchCmd = Disable;
        pstcInit->stcTriggerCond.enZeroMatchCmd = Disable;
        pstcInit->stcTriggerCond.enCmpAmcZicCmd = Disable;
        pstcInit->stcTriggerCond.enCmpAmcPicCmd = Disable;
        pstcInit->stcTriggerCond.u16MaskTimes = TIMER4_SEVT_MASK_0;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initialize Timer4 PWM
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_SEVT_DeInit(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCCR;
    __IO uint16_t *TMR4_SCSR;
    __IO uint16_t *TMR4_SCMR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check channel */
    if (IS_VALID_TIMER4_SEVT_CH(u32Ch))
    {
        /* Get actual address of register list of current channel */
        TMR4_SCCR = TMR4_SCCRx(M4_TMR4, u32Ch);
        TMR4_SCSR = TMR4_SCSRx(M4_TMR4, u32Ch);
        TMR4_SCMR = TMR4_SCMRx(M4_TMR4, u32Ch);

        /* Configure default parameter */
        WRITE_REG16(*TMR4_SCCR, 0x0U);
        WRITE_REG16(*TMR4_SCSR, 0x0000U);
        WRITE_REG16(*TMR4_SCMR, 0xFF00U);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 SEVT trigger event
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @param  [in] u16Event            Timer4 SEVT trigger event
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_TRIGGER_TMR4_SCMUH    Timer4 Special-EVT trigger event: TMR4_SCMUH
 *           @arg TIMER4_SEVT_TRIGGER_TMR4_SCMUL    Timer4 Special-EVT trigger event: TMR4_SCMUL
 *           @arg TIMER4_SEVT_TRIGGER_TMR4_SCMVH    Timer4 Special-EVT trigger event: TMR4_SCMVH
 *           @arg TIMER4_SEVT_TRIGGER_TMR4_SCMVL    Timer4 Special-EVT trigger event: TMR4_SCMVL
 *           @arg TIMER4_SEVT_TRIGGER_TMR4_SCMWH    Timer4 Special-EVT trigger event: TMR4_SCMWH
 *           @arg TIMER4_SEVT_TRIGGER_TMR4_SCMWL    Timer4 Special-EVT trigger event: TMR4_SCMWL
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TIMER4_SEVT_SetTriggerEvent(uint32_t u32Ch,
                                                    uint16_t u16Event)
{
    __IO uint16_t *TMR4_SCSR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer && channel */
    if (IS_VALID_TIMER4_SEVT_CH(u32Ch))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TIMER4_SEVT_TRIG_EVT(u16Event));

        /* Get actual address of register list of current channel */
        TMR4_SCSR = TMR4_SCSRx(M4_TMR4, u32Ch);

        /* Set SCSR register */
        MODIFY_REG16(*TMR4_SCSR, TMR4_SCSR_EVTOS, u16Event);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 SEVT trigger condition
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @param  [in] pstcTriggerCond     Pointer to a @ref stc_timer4_sevt_trigger_cond_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcTriggerCond = NULL
 */
en_result_t TIMER4_SEVT_SetTriggerCondition(uint32_t u32Ch,
                    const stc_timer4_sevt_trigger_cond_t *pstcTriggerCond)
{
    __IO uint16_t *TMR4_SCSR;
    __IO uint16_t *TMR4_SCMR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer && channel */
    if ((IS_VALID_TIMER4_SEVT_CH(u32Ch)) && (NULL != pstcTriggerCond))
    {
        /* Check parameters */
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTriggerCond->enDownMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTriggerCond->enPeakMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTriggerCond->enUpMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTriggerCond->enZeroMatchCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTriggerCond->enCmpAmcZicCmd));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcTriggerCond->enCmpAmcPicCmd));
        DDL_ASSERT(IS_VALID_TIMER4_SEVT_MASK(pstcTriggerCond->u16MaskTimes));

        /* Get actual address of register list of current channel */
        TMR4_SCSR = TMR4_SCSRx(M4_TMR4, u32Ch);
        TMR4_SCMR = TMR4_SCMRx(M4_TMR4, u32Ch);

        /* Set SCSR register */
        MODIFY_REG16(*TMR4_SCSR,                      \
                     (TMR4_SCSR_DEN | TMR4_SCSR_PEN | \
                      TMR4_SCSR_UEN | TMR4_SCSR_ZEN), \
                     ((uint16_t)((uint16_t)pstcTriggerCond->enDownMatchCmd << TMR4_SCSR_DEN_POS) | \
                      (uint16_t)((uint16_t)pstcTriggerCond->enPeakMatchCmd << TMR4_SCSR_PEN_POS) | \
                      (uint16_t)((uint16_t)pstcTriggerCond->enUpMatchCmd << TMR4_SCSR_UEN_POS)   | \
                      (uint16_t)((uint16_t)pstcTriggerCond->enZeroMatchCmd << TMR4_SCSR_ZEN_POS)));

        /* Set SCMR register */
        WRITE_REG16(*TMR4_SCMR,                      \
                    (pstcTriggerCond->u16MaskTimes | \
                     (uint16_t)((uint16_t)pstcTriggerCond->enCmpAmcZicCmd << TMR4_SCMR_MZCE_POS) | \
                     (uint16_t)((uint16_t)pstcTriggerCond->enCmpAmcPicCmd << TMR4_SCMR_MPCE_POS)));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set Timer4 SEVT delay object
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @param  [in] u16DelayObject      Timer4 SEVT delay object
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_DELAY_OCCRXH  TIMER4 SEVT delay object: OCCRxh
 *           @arg TIMER4_SEVT_DELAY_OCCRXL  TIMER4 SEVT delay object: OCCRxl
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_SEVT_SetDelayObject(uint32_t u32Ch, uint16_t u16DelayObject)
{
    __IO uint16_t *TMR4_SCSR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer && channel */
    if (IS_VALID_TIMER4_SEVT_CH(u32Ch))
    {
        /* Get actual address of register list of current channel */
        TMR4_SCSR = TMR4_SCSRx(M4_TMR4, u32Ch);

        /* Set SCSR register */
        MODIFY_REG16(*TMR4_SCSR, TMR4_SCSR_EVTDS, u16DelayObject);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 SEVT SCCR register value
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_SEVT_DELAY_OCCRXH  TIMER4 SEVT delay object: OCCRxh
 *           @arg TIMER4_SEVT_DELAY_OCCRXL  TIMER4 SEVT delay object: OCCRxl
 */
uint16_t TIMER4_SEVT_GetDelayObject(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCSR;

    /* Check channel */
    DDL_ASSERT(IS_VALID_TIMER4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCSR = TMR4_SCSRx(M4_TMR4, u32Ch);

    return READ_REG16_BIT(*TMR4_SCSR, TMR4_SCSR_EVTDS);
}

/**
 * @brief  Set Timer4 SEVT SCCR register value
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @param  [in] u16SccrVal          SCCR register value
 *           @arg number of 16bit
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_SEVT_SetSccrVal(uint32_t u32Ch,
                                            uint16_t u16SccrVal)
{
    __IO uint16_t *TMR4_SCCR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer && channel */
    if (IS_VALID_TIMER4_SEVT_CH(u32Ch))
    {
        /* Get actual address of register list of current channel */
        TMR4_SCCR = TMR4_SCCRx(M4_TMR4, u32Ch);

        /* Set SCCR register */
        WRITE_REG16(*TMR4_SCCR, u16SccrVal);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 SEVT SCCR register value
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @retval SCCR register value
 */
uint16_t TIMER4_SEVT_GetSccrVal(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCCR;

    /* Check channel */
    DDL_ASSERT(IS_VALID_TIMER4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCCR = TMR4_SCCRx(M4_TMR4, u32Ch);

    return READ_REG16(*TMR4_SCCR);
}

/**
 * @brief  Set Timer4 SEVT trigger event.
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @param  [in] u16MaskTimes        Mask times
 *           @arg TIMER4_SEVT_MASK_0:   Mask 0 times
 *           @arg TIMER4_SEVT_MASK_1:   Mask 1 times
 *           @arg TIMER4_SEVT_MASK_2:   Mask 2 times
 *           @arg TIMER4_SEVT_MASK_3:   Mask 3 times
 *           @arg TIMER4_SEVT_MASK_4:   Mask 4 times
 *           @arg TIMER4_SEVT_MASK_5:   Mask 5 times
 *           @arg TIMER4_SEVT_MASK_6:   Mask 6 times
 *           @arg TIMER4_SEVT_MASK_7:   Mask 7 times
 *           @arg TIMER4_SEVT_MASK_8:   Mask 8 times
 *           @arg TIMER4_SEVT_MASK_9:   Mask 9 times
 *           @arg TIMER4_SEVT_MASK_10:  Mask 10 times
 *           @arg TIMER4_SEVT_MASK_11:  Mask 11 times
 *           @arg TIMER4_SEVT_MASK_12:  Mask 12 times
 *           @arg TIMER4_SEVT_MASK_13:  Mask 13 times
 *           @arg TIMER4_SEVT_MASK_14:  Mask 14 times
 *           @arg TIMER4_SEVT_MASK_15:  Mask 15 times
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: u32Ch is invalid
 */
en_result_t TIMER4_SEVT_SetMaskTimes(uint32_t u32Ch,
                                            uint16_t u16MaskTimes)
{
    __IO uint16_t *TMR4_SCMR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check channel */
    if (IS_VALID_TIMER4_SEVT_CH(u32Ch))
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TIMER4_SEVT_MASK(u16MaskTimes));
        /* Get actual address of register list of current channel */
        TMR4_SCMR = TMR4_SCMRx(M4_TMR4, u32Ch);

        /* Set SCMR register */
        MODIFY_REG16(*TMR4_SCMR, TMR4_SCMR_AMC, u16MaskTimes);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get Timer4 SEVT SCCR register value
 * @param  [in] u32Ch               Timer4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_UH    Timer4 SEVT channel:UH
 *           @arg TIMER4_SEVT_UL    Timer4 SEVT channel:UL
 *           @arg TIMER4_SEVT_VH    Timer4 SEVT channel:VH
 *           @arg TIMER4_SEVT_VL    Timer4 SEVT channel:VL
 *           @arg TIMER4_SEVT_WH    Timer4 SEVT channel:WH
 *           @arg TIMER4_SEVT_WL    Timer4 SEVT channel:WL
 * @retval Returned value can be one of the following values:
 *           @arg TIMER4_SEVT_MASK_0:   Mask 0 times
 *           @arg TIMER4_SEVT_MASK_1:   Mask 1 times
 *           @arg TIMER4_SEVT_MASK_2:   Mask 2 times
 *           @arg TIMER4_SEVT_MASK_3:   Mask 3 times
 *           @arg TIMER4_SEVT_MASK_4:   Mask 4 times
 *           @arg TIMER4_SEVT_MASK_5:   Mask 5 times
 *           @arg TIMER4_SEVT_MASK_6:   Mask 6 times
 *           @arg TIMER4_SEVT_MASK_7:   Mask 7 times
 *           @arg TIMER4_SEVT_MASK_8:   Mask 8 times
 *           @arg TIMER4_SEVT_MASK_9:   Mask 9 times
 *           @arg TIMER4_SEVT_MASK_10:  Mask 10 times
 *           @arg TIMER4_SEVT_MASK_11:  Mask 11 times
 *           @arg TIMER4_SEVT_MASK_12:  Mask 12 times
 *           @arg TIMER4_SEVT_MASK_13:  Mask 13 times
 *           @arg TIMER4_SEVT_MASK_14:  Mask 14 times
 *           @arg TIMER4_SEVT_MASK_15:  Mask 15 times
 */
uint16_t TIMER4_SEVT_GetMaskTimes(uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCMR;

    /* Check channel */
    DDL_ASSERT(IS_VALID_TIMER4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCMR = TMR4_SCMRx(M4_TMR4, u32Ch);

    return READ_REG16_BIT(*TMR4_SCMR, TMR4_SCMR_AMC);
}

/**
 * @brief  Set Timer4 SEVT event signal output to port
 * @param  [in] u16EvtSig         Timer4 SEVT event signal selection
 *         This parameter can be one of the following values:
 *           @arg TIMER4_SEVT_EVTSIGx_OUTPUT_DISABLE: Disable output event signal of Timer4 Special-EVT
 *           @arg TIMER4_SEVT_EVTSIG0_OUTPUT:   Output the specified event signal 0 of Timer4 Special-EVT
 *           @arg TIMER4_SEVT_EVTSIG1_OUTPUT:   Output the specified event signal 1 of Timer4 Special-EVT
 *           @arg TIMER4_SEVT_EVTSIG2_OUTPUT:   Output the specified event signal 2 of Timer4 Special-EVT
 *           @arg TIMER4_SEVT_EVTSIG3_OUTPUT:   Output the specified event signal 3 of Timer4 Special-EVT
 *           @arg TIMER4_SEVT_EVTSIG4_OUTPUT:   Output the specified event signal 4 of Timer4 Special-EVT
 *           @arg TIMER4_SEVT_EVTSIG5_OUTPUT:   Output the specified event signal 5 of Timer4 Special-EVT
 * @retval None
 */
void TIMER4_SEVT_SetEvtSigOutput(uint16_t u16EvtSig)
{
    DDL_ASSERT(IS_VALID_TIMER4_SEVT_EVTSIG_OUTPUT(u16EvtSig));

    MODIFY_REG16(M4_TMR4->SCER, TMR4_SCER_EVTRS, u16EvtSig);
}

/**
 * @}
 */

/**
 * @}
 */

#endif /* DDL_TIMER4_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
